## LAB | Connecting Python to SQL

##### 
1.   Establish a connection between Python and the Sakila databas the two months.

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass
password = getpass.getpass()

 ········

In [2]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM customer', engine)
data.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20

#####
2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
    - engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
    - month: an integer representing the month for which rental data is to be retrieved.
    - year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [3]:
def rentals_month(engine, month, year):
    # Create a database connection
    connection_string = str('mysql+pymysql://root:'+password+'@localhost/sakila')
    engine = create_engine(connection_string)

    # Construct the SQL query
    query = f"""
        SELECT *
        FROM rental
        WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};
    """

    # Execute the query and load the result into a Pandas DataFrame
    df = pd.read_sql_query(query, engine)

    # Close the database connection
    engine.dispose()

    return df

engine = create_engine('mysql+pymysql://root:'+password+'@localhost/sakila')
df = rentals_month(engine, 5, 2005)
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

   3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".
Hint: Consider making use of pandas groupby()

In [5]:
def rental_count_month(df, month, year):
    # Create a new DataFrame with rental counts per customer_id
    rental_counts = df.groupby('customer_id').size().reset_index(name=f'rentals_{month:02d}_{year}')

    return rental_counts

rental_counts_df = rental_count_month(df, 5, 2005)
display(rental_counts_df)

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [9]:
def compare_rentals(df1, df2):
    # Merge the two DataFrames on 'customer_id'
    merged_df = pd.merge(df1, df2, on='customer_id', how='outer')

    # Fill NaN values with 0 (if a customer didn't rent in one of the months)
    merged_df = merged_df.fillna(0)

    # Calculate the difference between the number of rentals in the two months
    merged_df['difference'] = merged_df.iloc[:, 2] - merged_df.iloc[:, 1]

    return merged_df

# Example usage:
# Assume df_month1 and df_month2 are DataFrames obtained from rental_count_month function
rentals_df1 = rentals_month(engine, 5, 2005)
rentals_df2 = rentals_month(engine, 6, 2005)
df_month1 = rental_count_month(rentals_df1, 5, 2005)
df_month2 = rental_count_month(rentals_df2, 6, 2005)

# Use the compare_rentals function
comparison_df = compare_rentals(df_month1, df_month2)
display(comparison_df)

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1              2.0              7.0         5.0
1              2              1.0              1.0         0.0
2              3              2.0              4.0         2.0
3              5              3.0              5.0         2.0
4              6              3.0              4.0         1.0
..           ...              ...              ...         ...
593          583              0.0              6.0         6.0
594          585              0.0              4.0         4.0
595          591              0.0              3.0         3.0
596          592              0.0              5.0         5.0
597          598              0.0              1.0         1.0

[598 rows x 4 columns]